nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxc162/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXC162
package_id: MCXC162VFT
mcu_data: ksdk2_0
processor_version: 0.2603.90
board: FRDM-MCXC162
pin_labels:
- {pin_num: '18', pin_signal: P2_16/LPSPI0_SDI/LPUART1_RTS_B/CT0_MAT2/OPAMP0_OUT_EN/ADC0_A6/CMP0_IN4P, label: 'P2_16/J1[6]/J2[1]', identifier: CUR_A}
- {pin_num: '31', pin_signal: P3_11/TRIG_IN6/LPSPI0_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2, label: 'P3_11/J2[6]/J3[5]', identifier: PWM0_B2}
- {pin_num: '32', pin_signal: P3_10/TRIG_IN5/LPSPI0_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2, label: 'P3_10/J2[12]/J3[7]', identifier: PWM0_A2}
- {pin_num: '33', pin_signal: P3_9/TRIG_IN4/LPSPI0_SDI/LPUART1_TXD/CT_INP5/PWM0_B1, label: 'P3_9/J2[10]/J3[9]', identifier: PWM0_B1}
- {pin_num: '34', pin_signal: P3_8/TRIG_IN3/LPSPI0_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/CLKOUT, label: 'P3_8/J2[8]/J3[11]', identifier: PWM0_A1}
- {pin_num: '35', pin_signal: P3_1/TRIG_IN1/LPI2C0_SDA/CT_INP17/PWM0_B0/FREQME_CLK_OUT0, label: 'P3_1/J1[14]/J3[13]', identifier: PWM0_B0}
- {pin_num: '36', pin_signal: P3_0/TRIG_IN0/LPI2C0_SCL/CT_INP16/PWM0_A0, label: 'P3_0/J1[12]/J3[15]', identifier: PWM0_A0}
- {pin_num: '42', pin_signal: P0_6/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/CLKOUT/ADC0_A15, label: 'P0_6/J4[2]/J2[7]', identifier: VOLT_DCB}
- {pin_num: '45', pin_signal: P1_0/TRIG_IN0/LPSPI0_SDO/LPI2C0_SDA/CT_INP4/CT0_MAT2/ADC0_A16/CMP0_IN3, label: 'P1_0/J4[10]/J6[6]/J7[3]/J2[5]', identifier: CUR_C}
- {pin_num: '48', pin_signal: P1_3/TRIG_OUT1/LPSPI0_PCS0/LPI2C0_SCLS/CT1_MAT1/CT_INP1/ADC0_A19/CMP0_IN1, label: 'P1_3/J6[1]/J2[3]', identifier: CUR_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitLEDsPins();
    BOARD_InitBUTTONsPins();
    BOARD_InitADCPins();
    BOARD_InitCMPPins();
    BOARD_InitPWMPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm23_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '40', peripheral: LPUART0, signal: RX, pin_signal: P0_2/TDO/SWO/LPUART0_RXD/LPSPI0_SCK/CT0_MAT0, slew_rate: fast, open_drain: disable, drive_strength: high,
    pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '41', peripheral: LPUART0, signal: TX, pin_signal: P0_3/TDI/LPUART0_TXD/LPSPI0_SDO/CT0_MAT1/CMP0_OUT, slew_rate: fast, open_drain: disable, drive_strength: low,
    pull_select: up, pull_enable: enable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* LPUART0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);

    const port_pin_config_t DEBUG_UART_RX = {/* Internal pull-up/down resistor is disabled */
                                             .pullSelect = kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = kPORT_OpenDrainDisable,
                                             /* High drive strength is configured */
                                             .driveStrength = kPORT_HighDriveStrength,
                                             /* Normal drive strength is configured */
                                             .driveStrength1 = kPORT_NormalDriveStrength,
                                             /* Pin is configured as LPUART0_RXD */
                                             .mux = kPORT_MuxAlt2,
                                             /* Digital input enabled */
                                             .inputBuffer = kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             .invertInput = kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = kPORT_UnlockRegister};
    /* PORT0_2 (pin 40) is configured as LPUART0_RXD */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, &DEBUG_UART_RX);

    const port_pin_config_t DEBUG_UART_TX = {/* Internal pull-up resistor is enabled */
                                             .pullSelect = kPORT_PullUp,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             .driveStrength = kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             .driveStrength1 = kPORT_NormalDriveStrength,
                                             /* Pin is configured as LPUART0_TXD */
                                             .mux = kPORT_MuxAlt2,
                                             /* Digital input enabled */
                                             .inputBuffer = kPORT_InputBufferEnable,
                                             /* Digital input is not inverted */
                                             .invertInput = kPORT_InputNormal,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = kPORT_UnlockRegister};
    /* PORT0_3 (pin 41) is configured as LPUART0_TXD */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, &DEBUG_UART_TX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'true', coreID: cm23_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '13', peripheral: GPIO2, signal: 'GPIO, 3', pin_signal: P2_3/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT0_MAT3/OPAMP0_REF_EXT_REF1_EN/ADC0_A2, direction: OUTPUT,
    gpio_init_state: 'true', slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '15', peripheral: GPIO2, signal: 'GPIO, 7', pin_signal: P2_7/TRIG_IN5/LPUART3_TXD/CT_INP19/CT1_MAT3/OPAMP0_REF_EXT_REF0_EN/VREFI/ADC0_A7, direction: OUTPUT,
    gpio_init_state: 'true', slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: '3', peripheral: GPIO1, signal: 'GPIO, 10', pin_signal: P1_10/LPUART1_RTS_B/LPI2C0_SDAS/CT1_MAT0/ADC0_A8, direction: OUTPUT, gpio_init_state: 'true',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

