nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxc162/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADCPins(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* ADC0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kADC0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /*  Pwm0Sm0Muxtrig0 connect to Adc0Trig 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_Pwm0Sm0Muxtrig0ToAdc0Trig);

    /* PORT0_6 (pin 42) is configured as ADC0_A15 */
    PORT_SetPinMux(BOARD_INITADCPINS_VOLT_DCB_PORT, BOARD_INITADCPINS_VOLT_DCB_PIN, kPORT_MuxAlt0);

    PORT0->PCR[6] = ((PORT0->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT1_0 (pin 45) is configured as ADC0_A16 */
    PORT_SetPinMux(BOARD_INITADCPINS_CUR_C_PORT, BOARD_INITADCPINS_CUR_C_PIN, kPORT_MuxAlt0);

    PORT1->PCR[0] = ((PORT1->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    PORT1->PCR[3] = ((PORT1->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT1_3 (pin 48) is configured as ADC0_A19. */
                     | PORT_PCR_MUX(PORT1_PCR3_MUX_mux00)

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));

    /* PORT2_16 (pin 18) is configured as ADC0_A6 */
    PORT_SetPinMux(BOARD_INITADCPINS_CUR_A_PORT, BOARD_INITADCPINS_CUR_A_PIN, kPORT_MuxAlt0);

    PORT2->PCR[16] = ((PORT2->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Disables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMPPins:
- options: {callFromInitBoot: 'true', coreID: cm23_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '12', peripheral: CMP0, signal: 'IN, 0P', pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT0_MAT2/ADC0_A4/CMP0_IN0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMPPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMPPins(void)
{
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* CMP0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kCMP0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);

    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

                     /* Pin Multiplex Control: PORT2_2 (pin 12) is configured as CMP0_IN0. */
                     | PORT_PCR_MUX(PORT2_PCR2_MUX_mux00)

                     /* Input Buffer Enable: Disables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWMPins:
- options: {callFromInitBoot: 'true', coreID: cm23_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '36', peripheral: FLEXPWM0, signal: 'A, 0', pin_signal: P3_0/TRIG_IN0/LPI2C0_SCL/CT_INP16/PWM0_A0, direction: OUTPUT}
  - {pin_num: '35', peripheral: FLEXPWM0, signal: 'B, 0', pin_signal: P3_1/TRIG_IN1/LPI2C0_SDA/CT_INP17/PWM0_B0/FREQME_CLK_OUT0, direction: OUTPUT}
  - {pin_num: '34', peripheral: FLEXPWM0, signal: 'A, 1', pin_signal: P3_8/TRIG_IN3/LPSPI0_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/CLKOUT, direction: OUTPUT}
  - {pin_num: '33', peripheral: FLEXPWM0, signal: 'B, 1', pin_signal: P3_9/TRIG_IN4/LPSPI0_SDI/LPUART1_TXD/CT_INP5/PWM0_B1, direction: OUTPUT}
  - {pin_num: '32', peripheral: FLEXPWM0, signal: 'A, 2', pin_signal: P3_10/TRIG_IN5/LPSPI0_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2, direction: OUTPUT}
  - {pin_num: '31', peripheral: FLEXPWM0, signal: 'B, 2', pin_signal: P3_11/TRIG_IN6/LPSPI0_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2, direction: OUTPUT}
  - {peripheral: FLEXPWM0, signal: 'PWM_FAULT_TRG_CH, 0', pin_signal: cmp0_out}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWMPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWMPins(void)
{
    /* INPUTMUX0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateINPUTMUX0);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);
    /*  Cmp0Out connect to Flexpwm0Fault 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_Cmp0OutToFlexpwm0Fault);

    PORT3->PCR[0] = ((PORT3->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_MUX_MASK | PORT_PCR_IBE_MASK)))

