nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxc162/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
                     /* Pin Multiplex Control: PORT3_0 (pin 36) is configured as PWM0_A0. */
                     | PORT_PCR_MUX(PORT3_PCR0_MUX_mux101)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_1 (pin 35) is configured as PWM0_B0 */
    PORT_SetPinMux(BOARD_INITPWMPINS_PWM0_B0_PORT, BOARD_INITPWMPINS_PWM0_B0_PIN, kPORT_MuxAlt5);

    PORT3->PCR[1] = ((PORT3->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_10 (pin 32) is configured as PWM0_A2 */
    PORT_SetPinMux(BOARD_INITPWMPINS_PWM0_A2_PORT, BOARD_INITPWMPINS_PWM0_A2_PIN, kPORT_MuxAlt5);

    PORT3->PCR[10] = ((PORT3->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_11 (pin 31) is configured as PWM0_B2 */
    PORT_SetPinMux(BOARD_INITPWMPINS_PWM0_B2_PORT, BOARD_INITPWMPINS_PWM0_B2_PIN, kPORT_MuxAlt5);

    PORT3->PCR[11] = ((PORT3->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_8 (pin 34) is configured as PWM0_A1 */
    PORT_SetPinMux(BOARD_INITPWMPINS_PWM0_A1_PORT, BOARD_INITPWMPINS_PWM0_A1_PIN, kPORT_MuxAlt5);

    PORT3->PCR[8] = ((PORT3->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_9 (pin 33) is configured as PWM0_B1 */
    PORT_SetPinMux(BOARD_INITPWMPINS_PWM0_B1_PORT, BOARD_INITPWMPINS_PWM0_B1_PIN, kPORT_MuxAlt5);

    PORT3->PCR[9] = ((PORT3->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
